Repository: narattscoward/healthyme-iOS-final-project
Catalog: HealthyMe/Localizable.xcstrings
Source language: en
Languages: my

# action.delete
source: Delete
my: ဖျက်မည်

# addHabit.title
source: Add a habit
my: အလေ့အကျင့် ထပ်ထည့်ရန်

# auth.reason
source: Unlock with Face ID
my: Face ID ဖြင့် ဖွင့်ရန်

# button.addHabit
source: Add Habit
my: အလေ့အကျင့် ထပ်ထည့်မည်

# button.save
source: Save
my: သိမ်းမည်

# button.tryAgain
source: Try again
my: ထပ်မံကြိုးစားပါ

# check.emptyState
source: No habits yet. Add your first one to get started!
my: မရှိသေးပါ။ ပထမအကြိမ်အဖြစ် အကျင့်တစ်ခု ထည့်ပါ။

# common.ok
source: OK
my: အိုကေ

# common.save
source: Save
my: သိမ်းမည်

# details.description
source: Description
my: ဖော်ပြချက်

# form.habit
source: Habit
my: အလေ့အကျင့်

# form.notification
source: Notification
my: အသိပေးချက်

# form.time
source: Time
my: အချိန်

# gender.female
source: Female
my: မ

# gender.male
source: Male
my: ကျား

# gender.other
source: Other
my: အခြား

# gender.preferNot
source: Prefer not to say
my: မပြောလိုပါ

# help.body
source: Need help? • Email: u6611982@au.edu • Email: u6611919@au.edu • FAQ: Coming soon • Thanks for using HealthyMe! • SAM YATI & WYNE NADI
my: အကူအညီလိုပါသလား? • အီးမေးလ်: u6611982@au.edu • အီးမေးလ်: u6611919@au.edu • မေးလေ့ရှိသော မေးခွန်းများ: မကြာမီလာမည်! • HealthyMe ကို အသုံးပြုသည်အတွက် ကျေးဇူးတင်ပါသည်! • SAM YATI & WYNE NADI

# nav.dailyHabits
source: Daily Habits
my: နေ့စဉ်အလေ့အကျင့်များ

# nav.progress
source: Progress
my: တိုးတတ်မှု

# nav.settings
source: Settings
my: ဆက်တင်များ

# navigation.details.title
source: Details
my: အသေးစိတ်

# navigation.profile.title
source: Profile
my: ကိုယ်ရေးအချက်အလက်

# placeholder.habitName
source: Enter habit name
my: အလေ့အကျင့် အမည်ထည့်ပါ

# placeholder.height
source: Enter height
my: အမြင့် ထည့်ပါ

# placeholder.weight
source: Enter weight
my: အလေးချိန် ထည့်ပါ

# profile.birthday
source: Birthday
my: မွေးနေ့

# profile.gender
source: Gender
my: လိင်

# profile.height
source: Height (cm)
my: အမြင့် (စင်တီမီတာ)

# profile.name
source: Name
my: အမည်

# profile.username.fallback
source: Username
my: အသုံးပြုသူအမည်

# profile.weight
source: Weight (kg)
my: ကိုယ်အလေးချိန် (ကီလိုဂရမ်)

# progress.allTime
source: All Time
my: စုစုပေါင်း

# progress.bestStreak
source: Best Streak
my: အကောင်းဆုံး စံချိန်

# progress.completions
source: Completions
my: ပြီးမြောက်မှု

# progress.days.suffix
source: days
my: ရက်

# progress.hotStreaks
source: Hot Streaks
my: လက်ရှိစံချိန်များ

# progress.last28days
source: Last 28 Days
my: အရင် ၂၈ ရက်

# progress.noHotStreaks
source: No hot streaks yet. Keep going!
my: လက်ရှိစံချိန် မရှိသေးပါ။ ဆက်ကြိုးစားပါ!

# settings.help
source: Get Help
my: ကူညီမှု ရယူရန်

# settings.language
source: Language
my: ဘာသာစကား

# settings.notifications
source: Notifications
my: အသိပေးချက်များ

# settings.notifications.off.message
source: To enable reminders, allow notifications for HealthyMe in iOS Settings.
my: အသိပေးရန် Phone Settings တွင် HealthyMe အတွက် အသိပေးချက်များကို ဖွင့်ပေးပါ။

# settings.notifications.off.title
source: Notifications are Off
my: အသိပေးချက်များ ပိတ်ထားပါတယ်

# settings.terms
source: Terms and Policy
my: သတ်မှတ်ချက်နှင့် မူဝါဒ

# settings.theme
source: Theme
my: အပြင်အဆင်

# tab.check
source: Daily Habits
my: အလေ့အကျင့်များ

# tab.progress
source: Progress
my: တိုးတတ်မှု

# tab.settings
source: Settings
my: ဆက်တင်များ

# terms.body
source: • This app is a student project for educational use only. • It does not provide medical advice. • We don’t store or share personal data beyond what iOS stores locally. • Your data may be reset/cleared during development. • By continuing, you agree to these terms.
my: • ဤအက်ပ်သည် ကျောင်းပရောဂျက်ဖြစ်ပြီး ပညာရေးရည်ရွယ်ချက်အတွက်သာ ဖြစ်ပါသည်။ • ဆေးဘက်ဆိုင်ရာ အကြံဉာဏ် မပေးပါ။ • ဖုန်းတွင် သိမ်းဆည်းထားသော ဒေတာအပြင် မည်သည့် အချက်အလက်မျှ မသိမ်းဆည်းပါ။ • ဒီအဆင့်တွင် သင်၏ဒေတာတွေကိုဖျက်နိုင်သည်။ • ဆက်လက်အသုံးပြုခြင်းဖြင့် ဤစည်းကမ်းချက်များကို သဘောတူသည်ဟု သတ်မှတ်ပါသည်။

# theme.dark
source: Dark
my: အမှောင်

# theme.light
source: Light
my: အလင်း

# theme.system
source: System
my: စနစ်အလိုအလျောက်
